---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.Custom
source: html/0e2ea2e0-b26a-16ec-295e-51ba23e19579.htm
---
# Autodesk.Revit.DB.SymbolTypeId.Custom Property

Unrecognized custom symbol.

## Syntax (C#)
```csharp
public static ForgeTypeId Custom { get; }
```